/*
神經網路屬於人工智慧的範疇
本身並不具有任何功能
所以為了讓神經網路有足夠的判斷能力
必須先訓練神經網路(輸入一些題目及所期望的答案)
順練資料越多精準度越高
*/

var brain = require('brain');					//導入brain模組

var net = new brain.NeuralNetwork();				//建立一個神經網路

//訓練
net.train([							//使用三筆資料訓練
	{
		input : { r: 0.03, g: 0.7, b: 0.5},
		output : { black : 1}
	},
	{	
		input : { r: 0.16, g: 0.09, b: 0.2},
                output : { white : 1}
	},
	{
		input : { r: 0.5, g: 0.5, b: 1.0},
                output : { white : 1}
	}
]);

//判斷
console.log(net.run({ r: 1, g: 0.4, b: 0 }));			//顯示判斷過後神經網路對於判斷結果的比率

//----------------------------------------------
/*
{ black: 0.01483306265460236, white: 0.9852638368710159 }
*/
